Revit 2027 API
ElectricalLoadType Enumeration
 Represents the electrical load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalLoadType
Public Enumeration ElectricalLoadType
public enum class ElectricalLoadType
type ElectricalLoadType
Members
Member name | Value | Description
AreaBasedLoad | 1 |  Area Based Load
EquipmentLoad | 0 |  Equipment Load
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace